import classes.TextCharacteristics;
/*Ввод текста в графическое окно приложения. В панели инструментов окна (JToolBar) определены следующие компоненты
(JButton) с надписями: "Черный" (цвет по умолчанию),  "Красный", "Зеленый" и "Синий",  "12pt" (размер по умолчанию),
"14pt" и "16pt". В текстовой панели (JTextPane) "Ввод текста" окна приложения вводится текст, набираемый на клавиатуре.
При выборе на панели инструментов цвета и/или размера текст в панели выводится соответствующим цветом и/или
соответствующего размера.
 */

public class task14 {
    public static void main(String[] args) {
        new TextCharacteristics("Задание 14, Характеристики текста");//відкрити форму
    }
}
